[
    {
        "id": 1,
        "Title": "Food So Healthy, It Will Remind You Of Home",
        "Description": "Craving for homely food while living miles away from home? Fed up of the monotonous menu of common tiffin services? Looking for caterers to provide delicious spreads at your parties, at affordable prices? Then Green Soul Kitchens is your knight in shining armor!With an experience of over a decade in the food industry, Green Soul Kitchens is a North Indian daily food service and catering service dedicated to providing healthy, hygienic and homely vegetarian food at your door step, be it homes and offices. We closely understand the desire of our customers’ longing taste buds. However, above that, we fathom the need for nutrition and hygiene to be incorporated in one’s daily intake. Hence, Green Soul Kitchens has created a state of art kitchen, where some of the most highly qualified chefs of Pune put together a variety of healthy, vegetarian, mouth-watering North Indian delicacies, tending to your day to day food needs and desires simultaneously. We strongly believe in providing our customers a comfortable experience with their daily tiffin service. Thus, some features of Green Soul Kitchen’s daily tiffin service include, disposable containers, easy cancellations, choice of menu selection, home delivery and friendly and approachable staff. Apart from providing daily food services at homes and offices, we also specialize in event food catering. In this segment we have the facility of multi-cuisine spreads which are lavishly presented at a variety of occasions, be it, meetings and corporate events, birthday parties, kitty parties, family functions, college events or friendly get-togethers. The best part about Green Soul Kitchens is that it makes sure to meet your food needs without burning a hole in your pockets. Further, to make the process of ordering and setting up your meal plan with us convenient, we facilitate online tiffin service, where in you can place your orders and select your meal plans through an online portal on our website.",
        "ImageUrl": "http://greensoulkitchens.in/wp-content/uploads/2022/07/FOOD-SO-HEALTHY.jpg",
        "Date": "July 23, 2022"
    },

    {
        "id": 2,
        "Title": "Green Soul Kitchens Spreads Love And Health Through Its Food",
        "Description": "Want to have #GharJaisa healthy and hygienic food but also enjoy the additive spice at the same time? Well, we at Green Soul Kitchens provide the most nutritious food, as we care about your health while delight you with the spices. Why fresh and nutrition rich food? Most vegetables are naturally low in fat and calories which will keep a check on that tummy.Vegetables are important sources of many nutrients including potassium, dietary fiber, vitamin A and vitamin C.By having the adequate quantity of the appropriate source of different vitamins and minerals like Iron and Calcium rich rice, nutritious vegetables, proteins’ dal, crispy papads and delicious curd or dessert which gives you an experience of a balanced diet.Eating a diet, rich in vegetables as a part of an overall healthy diet reduces risk for heart diseases including heart attacks and strokes.Weight control is a common reason that you might consider eating healthily. Although following a balanced diet can help you lose weight or maintain a healthy weight.No matter what your age, your daily food choices can make a huge difference in your overall health and in how you feel and look.How does healthy eating affect your life? Many people really pay attention to the food they put in their bodies, until we get sick and need medical attention. I know that many of us love to eat fast food, but it catches up with us in the long run. While eating healthy would stop you from getting sick, and lower the cost of health care, healthy eating can enrich your body and prevent you from getting high doctor bills. How can you eat healthier? Healthy eating means picking all natural foods like fresh vegetables and fruits. Why do you think people recommend an Indian diet? The Indian diet is noted for its inclusion of many spices, pulses and rice, not forgetting its variety of flavours and colours which are what make this cuisine so unique. Being generally low in fat, high in vegetables, fruit and lean meat, an Indian diet has many health benefits. Finally, as Indian dishes have such an impacting taste often just a small portion can satisfy taste buds, helping you to consume fewer calories. An Indian diet’s variety and vibrancy keeps it interesting, which is a healthy component to any cuisine as variety can prevent boredom and overeating. Now that you know what to eat in order to keep yourself healthy, fit and fine, you just need to order it from the right place.",
        "ImageUrl": "http://greensoulkitchens.in/wp-content/uploads/2022/07/GREEN-SOUL-KITCHENS-SPREADS-LOVE.jpg",
        "Date": " July 23, 2022"
    },
    {
        "id": 3,
        "Title": "Bringing Home To Your Doorstep",
        "Description": "Here at Green Soul Kitchens, we believe in staying true to our name : To stay green in our souls and touch the soul of the city. With over a decade of experience in our name, we continue to be one of the trusted names when it comes to homemade food. Green Soul Kitchens offers a wide range of nutrition – enriched, scrumptious homemade food cooked with a warm touch of love and care. We not only have a plethora of options as part of our multicuisine menu, but we also have meals formulated in different ways to suit your needs. Additionally, a choice between vegetarian food and non – vegetarian food is also available to cater to your needs and desires. We take pride in the fact that we avoid food of prime quality and deliciousness. We offer three options in our menu : the happy meal combo, the mini meal combo and the roti subzi combo. We have a provision to schedule your meals and provide both dinner and lunch. An option to cancel your meal is also available but you may do so in the mandated time window. Our meals are reasonably priced and loaded with nourishment. We source our ingredients from the best available options. Our efforts reach you wherever you may be in this grand city, with our messengers of love delivering the warmth of home at your doorstep. All it takes is a decision on your part to order food, and we shall reach you. Our coverage reaches every nook and corner of the city and no matter where you are, our network will find you. Our clientele express deep satisfaction and we believe that customer satisfaction is as integral a part of our mission, as is the quality of our products and services.We re regarded as a premium tiffin service with a network outreach that serves love to our customers.  Our mission is bringing home to you, even as you conquer a city away from it.",
        "ImageUrl": "http://greensoulkitchens.in/wp-content/uploads/2022/07/BRINGING-HOME-TO-YOUR-DOORSTEP.jpg",
        "Date": "July 23, 2022"
    },
    {
        "id": 4,
        "Title": "Tiffins That Will Make Your Soul Green And Happy",
        "Description": "Looking for the best tiffin service in Pune?  Well look no further cause, we at Green Soul Kitchens are here to cater to your needs . Green Soul Kitchens is your one stop go for fresh healthy delicious food. With a Decade of experience and over 2000 satisfied and legal customers, Green Soul Kitchens has changed the game of food industry with the aim to become the aim to become the TOPMOST TRUSTWORTHY Home, Office and Industrial Catering Service Company. Hygiene and Taste is kept highly in regard by Green Soul Kitchens as we are here to make your soul Green and Happy. Ordering tiffin’s has never been so easier & better as we deliver it to you at your doorstep and we provide our customers with a variety of VEG, JAIN and NON-VEG combos at the most reasonable prices.",
        "ImageUrl": "http://greensoulkitchens.in/wp-content/uploads/2022/07/TIFFINS-THAT-WILL-MAKE-YOUR-SOUL-GREEN-AND-HAPPY.jpg",
        "Date": "July 23, 2022"
    },
    {
        "id": 5,
        "Title": "Five Famous & Mouthwatering Desi Dishes",
        "Description": "India is a land of Spices and rich Ingredients infused with love. Each and every state has its own speciality.You can come across lip-smacking dishes Fromany part of the country be it North,South,East and West. Indian Cuisine has made a a name for itself all over the world, crossing borders and spreading love through its food.Let’s dig into it and take a look at 5 dishes that have made a place in the stomachs of people all over the globe.",
        "ImageUrl": "http://greensoulkitchens.in/wp-content/uploads/2022/07/dal.jpg",
        "Date": "July 23, 2022"
    },
    {
        "id": 6,
        "Title": "A voyage to the north Indian delicacies.",
        "Description": "When the exotic spices from South India travelled thousands of miles to the North Indian kitchens, some delicacies were created over the last few centuries which agitated our taste buds with their heavenly taste and aroma. This was the cuisine that got famous and renowned all over the world and took pride in calling itself the North Indian food.The North Indian vegetarian food is a perfect blend of healthy vegetables and dairy products with spices. The integral food consist of curries and breads along with flavoured rices. The “Garam Masala” is a very important ingredient in the North Indian Food. the soul of the delicious curries. Curries are prepared after grinding the Masalas together and adding freshly chopped vegetables to it. Over the time, the North Indian recipes have travelled all over the globe. The too good to be true food of North India has become immensely popular and loved by the people of different countries. The spicy nature of food, the perfect use of spices and the mouth-watering taste has made the North Indian Food a premium category of cuisine.",
        "ImageUrl": "http://greensoulkitchens.in/wp-content/uploads/2022/07/spices3.jpg",
        "Date": "July 23, 2022"
    }
]